students/app/controllers/students_controller.rb

  def index
    @students = Student.all
---
SELECT * FROM "students"

  def show
    @student = Student.find(params[:id])
---
SELECT * FROM "students" WHERE ("students"."id" = 1)

  def edit
    @student = Student.find(params[:id])
---
SELECT * FROM "students" WHERE ("students"."id" = 2)

  def create
    @student = Student.new(params[:student])

    respond_to do |format|
      if @student.save
---
INSERT INTO "students" ("updated_at", "nama", "matrik", "email", "created_at") VALUES('2009-07-19 17:48:12', 'Abdul Hadi Jehmica', 'P50117', 'hadiFedEx@gmail.com', '2009-07-19 17:48:12')

  def find
    @student = Student.find(:all,
      :conditions=>["nama = ? OR matrik = ?", params[:search_string], params[:search_string]])
---
SELECT * FROM "students" WHERE (nama = 'hadi' OR matrik = 'hadi')